---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySunIntensityText
source: html/6723ae11-777f-cbd8-1201-d83e92daa338.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudySunIntensityText Property

"Sun intensity text"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudySunIntensityText { get; }
```